In [1]:
import pandas as pd

In [6]:
data = pd.read_excel('data/seo_data.xlsx')
data.head(10)

  subcategory_id  source         visits  Unnamed: 3
0     cf2e61c7af  direct  501165.668858         NaN
1     0cd903d1cc  direct  126342.359505         NaN
2     ef35bc88a7  direct   95626.321402         NaN
3     6ff9f4014c  direct   75680.653002         NaN
4     72bc238e4d  direct   64435.934651         NaN
5     88c78ea685  direct   39638.202995         NaN
6     179bfacf4a  direct   31007.471245         NaN
7     b0fb8f259a  direct   30324.097324         NaN
8     3c67eb2d90  direct   25878.814329         NaN
9     24e6c815c6  direct   25276.373358         NaN

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB

- subcategory_id — идентификатор товарной подкатегории, или её зашифрованное название;
- source — источник трафика. В нашем случае источников два: прямой заход на сайт в таблице обозначен как direct, переход из поисковых систем — organic;
- visits — количество визитов на страницу подкатегории за отчётный период.

#### 1. Пока в первых 5 строчках таблицы виден только один источник трафика direct. Проверьте, какие источники есть в столбце source. Выведите на экран список уникальных значений этого столбца.

In [13]:
data['source'].unique()

array(['direct', 'organic'], dtype=object)

#### 2. Методом read_excel() прочтите второй лист 'subcategory_ids' и сохраните его в переменной subcategory_dict. Выведите на экран его первые 5 строк методом head().Обратите внимание на названия столбцов: к знакомым нам идентификаторам подкатегорий (subcategory_id) добавились идентификаторы категорий (category_id) и названия подкатегорий (subcategory_name).
Всё это похоже на словарь, где идентификаторам подкатегорий из цифр и латинских букв соответствуют понятные нам названия. Поэтому датафрейм называется subcategory_dict.

In [16]:
subcategory_dict = pd.read_excel('data/seo_data.xlsx', sheet_name='subcategory_ids')
subcategory_dict.head()

  subcategory_id                subcategory_name category_id
0     cf2e61c7af              Мобильные телефоны  09f279a643
1     0cd903d1cc                        Ноутбуки  3509869a61
2     ef35bc88a7                      Телевизоры  09f279a643
3     6ff9f4014c                        Планшеты  3509869a61
4     72bc238e4d  Наушники и Bluetooth-гарнитуры  09f279a643

#### 3. Mетодом read_excel() прочтём третий лист category_ids и сохраним его в переменной category_dict. Выведите на экран первые 5 строк листа методом head().

In [17]:
category_dict = pd.read_excel('data/seo_data.xlsx', sheet_name='category_ids')
category_dict.head()

  category_id               category_name
0  09f279a643                 Электроника
1  3509869a61        Компьютерная техника
2  65922fa39c                        Авто
3  6074ad29ac  Одежда, обувь и аксессуары
4  10a493e03b         Товары для здоровья

#### 4. Переведите значения столбца 'id' из строк в числа методом to_numeric().

In [20]:
df = pd.read_excel('data/ids.xlsx')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        49 non-null     object
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [28]:
df['id'] = df['id'].replace('Null', None)
df['id'] = pd.to_numeric(df['id'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        49 non-null     int64
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

#### 5. Методом to_numeric() превратите значения столбца amount в числа, заменив некорректные значения на NaN. Проверьте результаты преобразований методом info().

In [31]:
df['amount'] = pd.to_numeric(df['amount'], errors='coerce')

#### 6. Посчитайте общую стоимость проданных товаров — сумму значений столбца amount

In [33]:
total = df['amount'].sum()
total

596107.1

#### 7. Рассчитайте сумму продаж для каждой категории.

In [34]:
category_amount = df.groupby('category')['amount'].sum()
category_amount

category
A       133988.50
B       168617.89
C       173332.50
D        62630.82
E        57537.39
Null         0.00
Name: amount, dtype: float64

#### 8. Вернитесь к таблице с трафиком: вы сможете найти сумму визитов.Раньше вместо неё получались склеенные названия категорий, а столбец visits определялся как строковый (тип object).Переведите значения столбца visits датафрейма data в числовой тип методом to_numeric()

In [37]:
data['visits'] = pd.to_numeric(data['visits'], errors='coerce')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1928 non-null   float64
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(2), object(2)
memory usage: 60.4+ KB

#### 9. Узнайте, что не так со строкой 964. Вызовите знакомый из вводного курса метод loc.

In [38]:
data.loc[964]

subcategory_id     total
source            direct
visits               NaN
Unnamed: 3           NaN
Name: 964, dtype: object

#### 10. Вычислите, сколько всего строк в датафрейме и выведите на экран.Затем выведите на экран строки, которые имеют значение 'total' в столбце 'subcategory_id'. Изучите полученные результаты: сколько строк портят весь датасет?

In [39]:
print('Кол-во строк', data.shape[0])

Кол-во строк 1930

In [41]:
total_rows = data[data['subcategory_id'] == 'total']
total_rows  #2

     subcategory_id   source  visits  Unnamed: 3
964           total   direct     NaN         NaN
1929          total  organic     NaN         NaN

#### 11. Оставьте в датафрейме только строки, удовлетворяющие условию data['subcategory_id'] != 'total'. Проверьте результат: выведите на экран датафрейм с условием data['subcategory_id'] == 'total'.

In [44]:
data = data[data['subcategory_id'] != 'total']
data.info()  # строк стало на 2 меньше

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1928 entries, 0 to 1928
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1928 non-null   object
 1   source          1928 non-null   object
 2   visits          1928 non-null   float64
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(2), object(2)
memory usage: 75.3+ KB

#### 12. Измените тип данных в столбце ['visits'] на integer. Проверьте полученный результат, вызвав метод info().

In [46]:
data['visits'] = data['visits'].astype(int)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1928 entries, 0 to 1928
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1928 non-null   object
 1   source          1928 non-null   object
 2   visits          1928 non-null   int32
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), int32(1), object(2)
memory usage: 67.8+ KB

#### 13. Сгруппируйте данные по источникам и вычислите количество визитов для каждого источника. Выведите результат на экран.

In [50]:
category_visits = data.groupby('source')['visits'].sum()
category_visits

source
direct     2368980
organic    5687407
Name: visits, dtype: int32

#### 14. Прочитайте файл с данными о позиции в поисковой выдаче за 3 месяца. Выведите первые 15 строк на экран.

In [53]:
position = pd.read_csv('data/position.csv')
position.head(15)

              timestamp  level   page_id
0   2019-02-04T13:22:34      1  6ukoNykP
1   2019-02-06T15:30:54      1  Q62R1Ue7
2   2019-02-08T14:53:45      1  GmfSxgPs
3   2019-02-10T16:50:22      2  M56OK96C
4   2019-02-12T14:16:28      1  q2fqVqPc
5   2019-02-14T15:10:45      1  LioXfSPk
6   2019-02-16T14:52:23      3  bQXWpQ2z
7   2019-02-18T15:45:33      2  gsFVGOTy
8   2019-02-20T16:35:12      3  zVuiSTm1
9   2019-02-22T15:52:27      1  kuULtbnm
10  2019-02-24T12:39:30      2  MKDhBt9L
11  2019-02-26T12:45:10      3  FEgRztcr
12  2019-03-04T15:34:46      4  OUBWQSCl
13  2019-03-06T14:20:57      5  6YeTUHgm
14  2019-03-08T12:34:43      6  zlrBrZ0d

In [54]:
position.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  39 non-null     object
 1   level      39 non-null     int64
 2   page_id    39 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.0+ KB

#### 15. Обработайте данные о времени в столбце 'timestamp': переведите их из строкового типа в datetime64. Разделителем даты и времени назначьте заглавную латинскую T. Выведите на экран первые 5 строк таблицы position.

In [57]:
position['timestamp'] = pd.to_datetime(position['timestamp'], format='%Y-%m-%dT%H:%M:%S')
position.head()

            timestamp  level   page_id
0 2019-02-04 13:22:34      1  6ukoNykP
1 2019-02-06 15:30:54      1  Q62R1Ue7
2 2019-02-08 14:53:45      1  GmfSxgPs
3 2019-02-10 16:50:22      2  M56OK96C
4 2019-02-12 14:16:28      1  q2fqVqPc

#### 16. Отсортируйте таблицу position по столбцу 'level' в порядке убывания и выведите на экран.

In [61]:
print(position.sort_values('level', ascending=False))

             timestamp  level   page_id
22 2019-03-24 13:49:22      9  WklxK6k4
38 2019-04-27 12:48:14      8  5VRryKr6
35 2019-04-21 14:40:17      8  JvTMAbs7
30 2019-04-11 13:39:15      8  9mL07Mjl
21 2019-03-22 16:36:19      8  s24ZIat3
15 2019-03-10 13:12:57      7  Vih5ARKA
34 2019-04-19 15:43:24      7  MSHZViNg
31 2019-04-13 12:13:26      7  ILfc3WmK
29 2019-04-09 14:57:20      7  SfnhoGh6
27 2019-04-05 14:51:38      7  7JKRCdPA
20 2019-03-20 15:53:36      7  VkTjZ6co
37 2019-04-25 16:10:50      6  clLGJ4g3
33 2019-04-17 16:54:17      6  JjIZd3Jy
28 2019-04-07 16:29:58      6  bsORIc79
24 2019-03-28 15:28:17      6  aQdvnaZX
19 2019-03-18 16:47:36      6  057NPKXX
14 2019-03-08 12:34:43      6  zlrBrZ0d
18 2019-03-16 16:18:34      5  zPH6tQwc
36 2019-04-23 13:17:19      5  6KVLFFQF
13 2019-03-06 14:20:57      5  6YeTUHgm
23 2019-03-26 15:50:31      5  p4Ofo5uP
25 2019-04-01 13:43:49      5  7UCXvXJu
32 2019-04-15 12:28:54      5  sCKAcOTN
12 2019-03-04 15:34:46      4  OUBWQSCl
17 2019-03-14 12:46:19      4  g4si3TQ8
16 2019-03-12 15:33:28      3  Y3wTtqaJ
6  2019-02-16 14:52:23      3  bQXWpQ2z
11 2019-02-26 12:45:10      3  FEgRztcr
8  2019-02-20 16:35:12      3  zVuiSTm1
3  2019-02-10 16:50:22      2  M56OK96C
10 2019-02-24 12:39:30      2  MKDhBt9L
7  2019-02-18 15:45:33      2  gsFVGOTy
26 2019-04-03 15:12:15      2  NJ1D9dAt
9  2019-02-22 15:52:27      1  kuULtbnm
5  2019-02-14 15:10:45      1  LioXfSPk
4  2019-02-12 14:16:28      1  q2fqVqPc
1  2019-02-06 15:30:54      1  Q62R1Ue7
2  2019-02-08 14:53:45      1  GmfSxgPs
0  2019-02-04 13:22:34      1  6ukoNykP

#### 17. Добавьте столбец 'month' в таблицу position с номером месяца. Выведите на экран первые 5 строк таблицы position.

In [64]:
position['month'] = pd.DatetimeIndex(position['timestamp']).month 
position.head()

            timestamp  level   page_id  month
0 2019-02-04 13:22:34      1  6ukoNykP      2
1 2019-02-06 15:30:54      1  Q62R1Ue7      2
2 2019-02-08 14:53:45      1  GmfSxgPs      2
3 2019-02-10 16:50:22      2  M56OK96C      2
4 2019-02-12 14:16:28      1  q2fqVqPc      2

#### 18. Сгруппируйте данные по столбцу 'month' и найдите среднюю позицию в выдаче по месяцам (level). Результат группировки выведите на экран.

In [65]:
print(position.groupby('month')['level'].mean())

month
2    1.750000
3    5.769231
4    6.214286
Name: level, dtype: float64

#### 19. Объедините самостоятельно таблицы subcategory_dict и data. Результат сохраните в переменной data_subcategory и выведите на экран первые 10 строк новой таблицы.

In [66]:
data_subcategory = data.merge(subcategory_dict, on='subcategory_id', how='left')
data_subcategory.head(10)

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id
0,cf2e61c7af,direct,501165,NaN,Мобильные телефоны,09f279a643
1,0cd903d1cc,direct,126342,NaN,Ноутбуки,3509869a61
2,ef35bc88a7,direct,95626,NaN,Телевизоры,09f279a643
3,6ff9f4014c,direct,75680,NaN,Планшеты,3509869a61
4,72bc238e4d,direct,64435,NaN,Наушники и Bluetooth-гарнитуры,09f279a643
5,88c78ea685,direct,39638,NaN,Шины,65922fa39c
6,179bfacf4a,direct,31007,NaN,Умные часы и браслеты,09f279a643
7,b0fb8f259a,direct,30324,NaN,Мониторы,3509869a61
8,3c67eb2d90,direct,25878,NaN,Наручные часы,6074ad29ac
9,24e6c815c6,direct,25276,NaN,Лекарственные препараты и БАДы,10a493e03b

#### 20. Получившуюся таблицу объедините с таблицей category_dict

In [70]:
data_final = data_subcategory.merge(category_dict, on='category_id', how='left')
data_final.head(10)

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id,category_name
0,cf2e61c7af,direct,501165,NaN,Мобильные телефоны,09f279a643,Электроника
1,0cd903d1cc,direct,126342,NaN,Ноутбуки,3509869a61,Компьютерная техника
2,ef35bc88a7,direct,95626,NaN,Телевизоры,09f279a643,Электроника
3,6ff9f4014c,direct,75680,NaN,Планшеты,3509869a61,Компьютерная техника
4,72bc238e4d,direct,64435,NaN,Наушники и Bluetooth-гарнитуры,09f279a643,Электроника
5,88c78ea685,direct,39638,NaN,Шины,65922fa39c,Авто
6,179bfacf4a,direct,31007,NaN,Умные часы и браслеты,09f279a643,Электроника
7,b0fb8f259a,direct,30324,NaN,Мониторы,3509869a61,Компьютерная техника
8,3c67eb2d90,direct,25878,NaN,Наручные часы,6074ad29ac,"Одежда, обувь и аксессуары"
9,24e6c815c6,direct,25276,NaN,Лекарственные препараты и БАДы,10a493e03b,Товары для здоровья

#### 21. Самостоятельно создайте сводную таблицу для набора data_final. Результат сохраните в переменной data_pivot и выведите первых 10 значений на экран.

In [73]:
data_pivot = data_final.pivot_table(
    index=['category_name', 'subcategory_name'], 
    columns='source', 
    values='visits', 
    aggfunc='sum')

data_pivot

source                                   direct  organic
category_name subcategory_name
Авто          Автоакустика                 5915    15433
              Автомагнитолы                7783    18690
              Автомобильные инверторы       145      150
              Автомобильные компрессоры     407      790
              Автомобильные телевизоры      975     2246
...                                         ...      ...
Электроника   Чехлы                        4582    11758
              Чехлы-аккумуляторы            219      331
              Штативы и моноподы           1152     2540
              Экшн-камеры                  4757    12376
              Электронные книги            4515    11364

[934 rows x 2 columns]